import time


ENCODINGS_LIST = ["utf-8", "cp1251"]
DOUBLEQUOTE = '"'
TECHNOSTOR_DROP_LIST = [
    # "Артикул",
    "Москва",
    "Москва Интервал",
    "Калуга",
    "Ссылка",
    "Категория доставки",
]
VSTROYKA_SOLO_DROP_LIST = [
    # "Артикул",
    "Родитель",
    "Категория",
    "Вид товара",
    "Ссылка",
    "Описание",
    "Доставка",
    "Приоритет",
    "Заказ",
]
TECHNOSTOR_COLUMNS_TO_RENAME = {
    "Артикул": "Код артикула",
    "Категория": "Тип товаров",
    "Производитель": "Производитель",
    "Товар": "Наименование",
    "Цена": "Цена",
    "Остаток": "В наличии",
    "Модель": "Модель",
    "Изображение": "Изображения товаров",
    "РРЦ": "РРЦ",
}
VSTROYKA_SOLO_COLUMNS_TO_RENAME = {
    "Артикул": "Код артикула",
    "Раздел": "Тип товаров",
    "Бренд": "Производитель",
    "Наименование": "Наименование",
    "Цена": "Цена",
    "Модель": "Модель",
    "Фото": "Изображения товаров",
    "РРЦ": "РРЦ",
}
COLUMNS_ORDER = [
    "Код артикула",
    "Тип товаров",
    "Производитель",
    "Наименование",
    "Цена",
    "В наличии",
    "Модель",
    "Изображения товаров",
    "РРЦ",
]
PRICE = "Цена"
RRP = "РРЦ"
PRODUCT_NAME = "Наименование"
PRODUCT_TYPE = "Тип товаров"
PRODUCT_PHOTO = "Изображения товаров"
CURRENT_DATE = time.strftime("%d-%m-%Y")
OUTPUT_FILE = f"merged_price_{CURRENT_DATE}.csv"
EMPTY_PHOTO = "https://technostor.ru/images/products/oynw/0.jpeg"
